SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `innenu-service`
--

-- --------------------------------------------------------

--
-- 表的结构 `admin`
--

CREATE TABLE `admin` (
  `openid` varchar(128) NOT NULL COMMENT 'OPENID',
  `remark` varchar(60) NOT NULL COMMENT '备注'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `condition_blacklist`
--

CREATE TABLE `condition_blacklist` (
  `id` int(11) NOT NULL,
  `name` varchar(20) DEFAULT NULL COMMENT '姓名',
  `type` varchar(32) DEFAULT NULL COMMENT '类别',
  `grade` smallint(6) DEFAULT NULL COMMENT '年级',
  `org` varchar(32) DEFAULT NULL COMMENT '组织',
  `major` int(32) DEFAULT NULL COMMENT '专业',
  `remark` varchar(40) NOT NULL COMMENT '备注'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `contact`
--

CREATE TABLE `contact` (
  `uuid` char(36) NOT NULL COMMENT 'UUID',
  `appId` varchar(36) NOT NULL COMMENT '小程序原始ID',
  `openid` varchar(128) NOT NULL COMMENT '用户openid',
  `type` varchar(36) NOT NULL COMMENT '事件类型',
  `content` text COMMENT '文字内容',
  `createTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `id_blacklist`
--

CREATE TABLE `id_blacklist` (
  `id` int(11) NOT NULL COMMENT '学号',
  `remark` varchar(200) NOT NULL COMMENT '备注'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `id_code`
--

CREATE TABLE `id_code` (
  `uuid` char(24) NOT NULL COMMENT '短UUID',
  `openid` varchar(128) DEFAULT NULL COMMENT 'OPEN ID',
  `id` int(11) DEFAULT NULL COMMENT '学号',
  `remark` varchar(40) DEFAULT NULL COMMENT '备注',
  `verifyId` int(11) DEFAULT NULL COMMENT '验证人学号',
  `verifyRemark` varchar(40) DEFAULT NULL COMMENT '验证备注',
  `createTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `verifyTime` timestamp NULL DEFAULT NULL COMMENT '验证时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `log`
--

CREATE TABLE `log` (
  `uuid` char(36) NOT NULL COMMENT 'UUID',
  `createTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `type` varchar(16) DEFAULT NULL COMMENT '类型',
  `content` json DEFAULT NULL COMMENT '文字'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `major_id`
--

CREATE TABLE `major_id` (
  `majorId` varchar(64) NOT NULL COMMENT '专业 ID',
  `major` varchar(64) NOT NULL COMMENT '专业名称',
  `orgId` mediumint(9) NOT NULL COMMENT '机构 ID'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `major_id`
--

INSERT INTO `major_id` (`majorId`, `major`, `orgId`) VALUES
('', '', 159000),
('', '', 161000),
('', '', 162000),
('', '', 166000),
('', '', 167000),
('', '', 169000),
('', '', 175000),
('', '', 177000),
('', '', 185000),
('', '', 197000),
('', '', 235000),
('', '', 236000),
('', '', 239000),
('', '', 247000),
('', '', 252000),
('', '', 261000),
('', '', 264000),
('', '', 265000),
('010101', '马克思主义哲学', 236000),
('010102', '中国哲学', 236000),
('010103', '外国哲学', 236000),
('010105', '伦理学', 236000),
('010108', '科学技术哲学', 236000),
('020101', '汉语言文学', 164000),
('020202', '区域经济学', 261000),
('020204', '金融学', 261000),
('020205', '产业经济学', 261000),
('020207', '劳动经济学', 261000),
('025100', '金融', 261000),
('025200', '应用统计', 170000),
('030100', '法学', 161000),
('030200', '政治学', 161000),
('030202', '中外政治制度', 161000),
('030204', '中共党史', 161000),
('030300', '社会学', 236000),
('030501', '马克思主义基本原理', 236000),
('030502', '马克思主义发展史', 236000),
('030503', '马克思主义中国化研究', 236000),
('030504', '国外马克思主义研究', 236000),
('030505', '思想政治教育', 135000),
('030505', '思想政治教育', 161000),
('030505', '思想政治教育', 236000),
('030506', '中国近现代史基本问题研究', 236000),
('0305Z1', '党的建设', 236000),
('035101', '法律（非法学）', 161000),
('035102', '法律（法学）', 161000),
('035200', '社会工作', 236000),
('040101', '教育学原理', 232000),
('040102', '课程与教学论', 161000),
('040102', '课程与教学论', 164000),
('040102', '课程与教学论', 166000),
('040102', '课程与教学论', 168000),
('040102', '课程与教学论', 173000),
('040102', '课程与教学论', 232000),
('040102', '课程与教学论', 234000),
('040103', '教育史', 232000),
('040104', '比较教育学', 232000),
('040105', '学前教育学', 232000),
('040106', '高等教育学', 232000),
('040110', '教育技术学', 252000),
('0401Z1', '农村教育', 232000),
('0401Z2', '教师教育', 159000),
('0401Z2', '教师教育', 232000),
('0401Z4', '教育统计、测量与评价', 232000),
('040201', '基础心理学', 253000),
('040202', '发展与教育心理学', 253000),
('040203', '应用心理学', 253000),
('040301', '体育人文社会学', 177000),
('040302', '运动人体科学', 177000),
('040303', '体育教育训练学', 177000),
('040304', '民族传统体育学', 177000),
('045100', '教育', 232000),
('045102', '学科教学（思政）', 161000),
('045103', '学科教学（语文）', 164000),
('045104', '学科教学（数学）', 170000),
('045105', '学科教学（物理）', 173000),
('045106', '学科教学（化学）', 174000),
('045107', '学科教学（生物）', 159000),
('045107', '学科教学（生物）', 175000),
('045108', '学科教学（英语）', 167000),
('045109', '学科教学（历史）', 166000),
('045110', '学科教学（地理）', 234000),
('045111', '学科教学（音乐）', 168000),
('045112', '学科教学（体育）', 177000),
('045113', '学科教学（美术）', 169000),
('045114', '现代教育技术', 252000),
('045115', '小学教育', 232000),
('045116', '心理健康教育', 253000),
('045118', '学前教育', 232000),
('045171', '学校课程与教学', 232000),
('045172', '学生发展与教育', 232000),
('045173', '教育领导与管理', 232000),
('045174', '汉语国际教育', 232000),
('045174', '汉语国际教育', 246000),
('045201', '体育教学', 177000),
('045202', '运动训练', 177000),
('045300', '汉语国际教育', 246000),
('045400', '应用心理', 253000),
('047101', '教育经济与管理', 232000),
('050101', '文艺学', 164000),
('050102', '语言学及应用语言学', 164000),
('050103', '汉语言文字学', 164000),
('050104', '中国古典文献学', 164000),
('050105', '中国古代文学', 164000),
('050106', '中国现当代文学', 164000),
('050108', '比较文学与世界文学', 164000),
('0501Z1', '对外汉语', 164000),
('0501Z2', '语文教育', 164000),
('050201', '英语语言文学', 167000),
('050202', '俄语语言文学', 167000),
('050205', '日语语言文学', 167000),
('050211', '外国语言学及应用语言学', 167000),
('0502Z2', '外语教育', 167000),
('050301', '新闻学', 178000),
('050302', '传播学', 178000),
('055101', '英语笔译', 167000),
('055102', '英语口译', 167000),
('055103', '俄语笔译', 167000),
('055104', '俄语口译', 167000),
('055105', '日语笔译', 167000),
('055200', '新闻与传播', 178000),
('060100', '考古学', 166000),
('060200', '中国史', 166000),
('060300', '世界史', 166000),
('0603Z1', '古代西亚、北非和欧洲文明史研究', 166000),
('065100', '文物与博物馆', 166000),
('070101', '基础数学', 170000),
('070102', '计算数学', 170000),
('070104', '应用数学', 170000),
('070105', '运筹学与控制论', 170000),
('0701Z1', '数学教育', 170000),
('0701Z2', '数学技术', 170000),
('070201', '理论物理', 173000),
('070202', '粒子物理与原子核物理', 173000),
('070205', '凝聚态物理', 173000),
('070207', '光学', 173000),
('0702Z1', '应用物理', 173000),
('070300', '化学', 174000),
('070301', '无机化学', 174000),
('070302', '分析化学', 174000),
('070303', '有机化学', 174000),
('070304', '物理化学', 174000),
('070305', '高分子化学与物理', 174000),
('070501', '自然地理学', 234000),
('070502', '人文地理学', 234000),
('070503', '地图学与地理信息系统', 234000),
('0705Z1', '城市与区域规划', 234000),
('0705Z2', '湿地科学', 234000),
('071000', '生物学', 175000),
('071002', '动物学', 175000),
('071009', '细胞生物学', 175000),
('071010', '生物化学与分子生物学', 175000),
('071300', '生态学', 175000),
('071300', '生态学', 235000),
('071400', '统计学', 170000),
('0714Z1', '机器学习与生物信息学', 170000),
('077300', '材料科学与工程', 173000),
('077301', '材料物理与化学', 173000),
('077302', '材料学', 173000),
('077500', '计算机科学与技术', 252000),
('077600', '环境科学与工程', 235000),
('078401', '教育技术学', 252000),
('080501', '材料物理与化学', 173000),
('081100', '控制科学与工程', 173000),
('081202', '计算机软件与理论', 252000),
('083001', '环境科学', 235000),
('083002', '环境工程', 235000),
('083300', '城乡规划学', 234000),
('085300', '城市规划', 234000),
('085400', '电子信息', 173000),
('085400', '电子信息', 252000),
('085404', '计算机技术', 252000),
('085405', '软件工程', 252000),
('085410', '人工智能', 252000),
('085600', '材料与化工', 174000),
('085700', '资源与环境', 235000),
('086000', '生物与医药', 175000),
('090900', '草学', 175000),
('1013959', '思想政治教育（公费师范）', 161000),
('1013963', '心理学（公费师范）', 253000),
('1013965', '历史学（公费师范）', 166000),
('1013966', '物理学（公费师范）', 173000),
('1013967', '小学教育（公费师范）', 232000),
('1013969', '化学（公费师范）', 174000),
('1013970', '教育技术学（公费师范）', 252000),
('1013971', '学前教育（公费师范）', 232000),
('1013972', '汉语言文学（公费师范）', 164000),
('1013973', '英语（公费师范）', 167000),
('1013975', '数学与应用数学（公费师范）', 170000),
('1013977', '体育教育（公费师范）', 177000),
('1013978', '美术学（师范）', 169000),
('1013979', '生物科学（公费师范）', 175000),
('1013980', '地理科学（公费师范）', 234000),
('1013982', '经济学', 261000),
('1013983', '教育学类', 232000),
('1013984', '经济学类', 261000),
('1013985', '设计学类', 169000),
('1013988', '计算机科学与技术（中美合作）', 252000),
('1013991', '思想政治教育', 236000),
('1013992', '俄语', 167000),
('1013994', '舞蹈编导', 168000),
('1013996', '国际政治', 161000),
('1013997', '心理学', 253000),
('1013998', '统计学', 170000),
('1014001', '历史学', 166000),
('1014003', '广告学', 178000),
('1014006', '环境工程', 235000),
('1014012', '会计学（中美合作）', 261000),
('1014013', '播音与主持艺术', 178000),
('1014014', '日语', 167000),
('1014015', '商务英语', 167000),
('1014016', '化学', 174000),
('1014017', '环境科学', 235000),
('1014018', '哲学', 236000),
('1014020', '金融学', 261000),
('1014021', '图书馆学', 252000),
('1014022', '教育技术学', 252000),
('1014023', '社会学', 236000),
('1014024', '行政管理', 161000),
('1014025', '雕塑', 169000),
('1014026', '学前教育', 232000),
('1014027', '市场营销', 261000),
('1014028', '材料物理', 173000),
('1014029', '汉语言文学', 164000),
('1014030', '英语', 167000),
('1014031', '教育学', 232000),
('1014033', '人力资源管理', 261000),
('1014034', '视觉传达设计', 169000),
('1014035', '武术与民族传统体育', 177000),
('1014036', '数学与应用数学', 170000),
('1014037', '生物技术', 175000),
('1014039', '地理信息科学', 234000),
('1014041', '体育教育', 177000),
('1014043', '美术学', 169000),
('1014044', '会计学', 261000),
('1014046', '生物科学', 175000),
('1014047', '电子信息科学与技术', 173000),
('1014048', '法学', 161000),
('1014049', '计算机科学与技术', 252000),
('1014051', '美术学（中国画）', 169000),
('1014052', '美术学（油画）', 169000),
('1014053', '服装与服饰设计', 169000),
('1014054', '广播电视编导', 178000),
('1014055', '运动训练', 177000),
('1014056', '地理科学', 234000),
('1014073', '英语（科技交流）', 167000),
('1014080', '音乐学（器乐）', 168000),
('1014085', '美术学（水彩画）', 169000),
('1014086', '美术学（版画）', 169000),
('1014099', '数字媒体技术', 178000),
('1014100', '政治学与行政学', 161000),
('1014109', '生物科学类', 175000),
('1014128', '地理科学类', 234000),
('1014132', '物理学', 173000),
('1014133', '人文地理与城乡规划', 234000),
('1014134', '生态学', 235000),
('1014135', '环境设计', 169000),
('1014136', '小学教育', 232000),
('1014138', '音乐学（声乐，师范）', 168000),
('1014139', '新闻传播学类', 178000),
('1014143', '政治学类', 161000),
('1014147', '音乐学（钢琴，师范）', 168000),
('1014148', '新闻学', 178000),
('1014150', '环境科学与工程类', 235000),
('1014153', '马克思主义理论类', 236000),
('1014154', '物理学类', 173000),
('1014160', '化学（优师专项）', 174000),
('1014161', '历史学（优师专项）', 166000),
('1014162', '视觉传达设计(数字媒介设计)', 169000),
('1014168', '汉语言文学（优师专项）', 164000),
('1014170', '数学与应用数学（优师专项）', 170000),
('1014171', '英语（优师专项）', 167000),
('1014175', '智能科学与技术', 252000),
('1014176', '物理学（优师专项）', 173000),
('1014177', '生物科学（优师专项）', 175000),
('1014184', '商务英语（预科）', 167000),
('1014187', '计算机类（预科）', 252000),
('1014192', '美术学（综合材料绘画）', 169000),
('1014193', '地理科学（优师专项）', 234000),
('1014198', '地理科学类（预科）', 234000),
('1014199', '德语', 167000),
('1014201', '数学类', 170000),
('1014208', '计算机类', 252000),
('1014209', '冰雪运动', 177000),
('1066', '英语（科技交流）', 167000),
('120201', '会计学', 261000),
('120202', '企业管理', 261000),
('120400', '公共管理', 161000),
('120501', '图书馆学', 252000),
('120502', '情报学', 252000),
('125100', '工商管理', 261000),
('125200', '公共管理', 161000),
('125300', '会计', 261000),
('125500', '图书情报', 252000),
('130100', '艺术学', 168000),
('130100', '艺术学', 169000),
('130100', '艺术学', 178000),
('130200', '音乐与舞蹈学', 168000),
('130300', '戏剧与影视学', 178000),
('130309', '播音与主持艺术', 178000),
('130400', '美术学', 169000),
('130500', '设计学', 169000),
('135101', '音乐', 168000),
('135105', '广播电视', 178000),
('135106', '舞蹈', 168000),
('135107', '美术', 169000),
('135108', '艺术设计', 169000),
('135200', '音乐', 168000),
('135300', '舞蹈', 168000),
('135400', '戏剧与影视', 164000),
('135400', '戏剧与影视', 178000),
('135600', '美术与书法', 169000),
('135700', '设计', 169000),
('140300', '设计学', 169000),
('158010', '教育学类', 232000),
('158011', '教育学类（预科）', 232000),
('158110', '教育学', 232000),
('158120', '学前教育', 232000),
('158121', '学前教育（公费师范）', 232000),
('158130', '小学教育', 232000),
('158131', '小学教育（公费师范）', 232000),
('158140', '心理学', 253000),
('158141', '心理学（公费师范）', 253000),
('158142', '心理学（预科）', 253000),
('161010', '政治学类', 161000),
('161011', '政治学类（预科）', 161000),
('161110', '国际政治', 161000),
('161120', '思想政治教育', 236000),
('161121', '思想政治教育（公费师范）', 161000),
('161122', '思想政治教育（第二学士学位）', 236000),
('161123', '思想政治教育（优师专项）', 161000),
('161130', '行政管理', 161000),
('161140', '法学', 161000),
('161141', '法学（预科）', 161000),
('161150', '政治学与行政学', 161000),
('162010', '经济学类', 261000),
('162011', '经济学类（预科）', 261000),
('162110', '经济学', 261000),
('162150', '金融学', 261000),
('163010', '工商管理类', 261000),
('163110', '市场营销', 261000),
('163120', '人力资源管理', 261000),
('163140', '会计学', 261000),
('163141', '会计学（中美合作）', 261000),
('164110', '汉语言文学', 164000),
('164111', '汉语言文学（公费师范）', 164000),
('164112', '汉语言文学（优师专项）', 164000),
('164114', '汉语言文学（预科）', 164000),
('166110', '历史学', 166000),
('166111', '历史学（公费师范）', 166000),
('166113', '历史学（第二学士学位）', 166000),
('166114', '历史学（优师专项）', 166000),
('166115', '历史学（预科）', 166000),
('166116', '历史学（日知试验班）', 166000),
('167110', '英语', 167000),
('167111', '英语（公费师范）', 167000),
('167115', '英语（预科）', 167000),
('167118', '英语（优师专项）', 167000),
('167120', '俄语', 167000),
('167122', '俄语（预科）', 167000),
('167130', '日语', 167000),
('167133', '日语（预科）', 167000),
('167140', '商务英语', 167000),
('167141', '商务英语（预科）', 167000),
('167180', '德语', 167000),
('168110', '音乐学', 168000),
('168111', '音乐学（师范）', 168000),
('168114', '音乐学（声乐）', 168000),
('168115', '音乐学（器乐）', 168000),
('168120', '舞蹈编导', 168000),
('168126', '音乐学（钢琴，师范）', 168000),
('168127', '音乐学（声乐，师范）', 168000),
('168193', '音乐学（钢琴演奏）', 168000),
('169030', '设计学类', 169000),
('169110', '美术学', 169000),
('169111', '美术学（师范）', 169000),
('169113', '美术学（中国画）', 169000),
('169114', '美术学（水彩画）', 169000),
('169115', '美术学（版画）', 169000),
('169116', '美术学（油画）', 169000),
('169119', '美术学（综合实验艺术）', 169000),
('169120', '雕塑', 169000),
('169121', '美术学（综合材料绘画）', 169000),
('169130', '视觉传达设计', 169000),
('169132', '视觉传达设计(数字媒介设计)', 169000),
('169132', '视觉传达设计(数字媒介设计)', 178000),
('169140', '环境设计', 169000),
('169160', '服装与服饰设计', 169000),
('170014', '数学与应用数学（陆家羲试验班）', 170000),
('170110', '数学与应用数学', 170000),
('170111', '数学与应用数学（公费师范）', 170000),
('170112', '数学与应用数学（优师专项）', 170000),
('170120', '统计学', 170000),
('170121', '统计学（本硕博基地班）', 170000),
('170910', '数学类', 170000),
('171110', '教育技术学', 252000),
('171111', '教育技术学（公费师范）', 252000),
('171120', '计算机科学与技术', 252000),
('171121', '计算机科学与技术（中美合作）', 252000),
('171123', '计算机科学与技术（第二学士学位）', 252000),
('171130', '图书馆学', 161000),
('171130', '图书馆学', 252000),
('171150', '信息资源管理', 252000),
('173110', '物理学', 173000),
('173111', '物理学（公费师范）', 173000),
('173112', '物理学（优师专项）', 173000),
('173113', '物理学（陆家羲数理基地班）', 173000),
('173114', '物理学（陆家羲试验班）', 173000),
('173120', '材料物理', 173000),
('173121', '材料物理（第二学士学位）', 173000),
('173140', '电子信息科学与技术', 173000),
('173910', '物理学类', 173000),
('173911', '物理学类（预科）', 173000),
('174110', '化学', 174000),
('174111', '化学（公费师范）', 174000),
('174112', '化学（第二学士学位）', 174000),
('174113', '化学（优师专项）', 174000),
('175110', '生物科学', 175000),
('175111', '生物科学（公费师范）', 175000),
('175112', '生物科学（优师专项）', 175000),
('175113', '生物科学（郝水试验班）', 175000),
('175120', '生物技术', 175000),
('175910', '生物科学类', 175000),
('177110', '体育教育', 177000),
('177111', '体育教育（公费师范）', 177000),
('177120', '运动训练', 177000),
('177130', '武术与民族传统体育', 177000),
('177140', '冰雪运动', 177000),
('178010', '新闻传播学类', 178000),
('178011', '新闻传播学类（预科）', 178000),
('178120', '广告学', 178000),
('178130', '广播电视编导', 178000),
('178140', '播音与主持艺术', 178000),
('178160', '数字媒体技术', 178000),
('178161', '数字媒体技术（预科）', 178000),
('178170', '新闻学', 178000),
('179110', '哲学', 236000),
('179120', '社会学', 236000),
('179122', '社会学（第二学士学位）', 236000),
('179910', '马克思主义理论类', 236000),
('179911', '马克思主义理论类（预科）', 236000),
('224096987', '历史学（日知试验班）', 166000),
('224096989', '数学与应用数学（陆家羲试验班）', 170000),
('224097141', '金融学（中外合作办学）', 245000),
('234110', '地理科学', 234000),
('234111', '地理科学（公费师范）', 234000),
('234112', '地理科学（第二学士学位）', 0),
('234112', '地理科学（第二学士学位）', 234000),
('234113', '地理科学（优师专项）', 234000),
('234130', '人文地理与城乡规划', 234000),
('234140', '地理信息科学', 234000),
('234910', '地理科学类', 234000),
('234911', '地理科学类（预科）', 234000),
('235010', '环境科学与工程类', 235000),
('235011', '环境科学与工程类（预科）', 235000),
('235110', '生态学', 235000),
('235120', '环境科学', 235000),
('235140', '环境工程', 235000),
('245110', '物流管理（供应链管理）', 245000),
('245121', '金融学（中外合作办学）', 245000),
('252010', '计算机类', 252000),
('252011', '计算机类（预科）', 252000),
('252160', '智能科学与技术', 252000),
('5FC38F734AC14DD5A20BC665A8FFD347', '计算机科学与技术', 252000),
('7E26D53D943D42D9BF3A41DB91BA0106', '教育技术学（公费师范）', 252000),
('7FDF1816D7CC4C77B85A451363B64778', '物理学', 173000),
('AE5B35F12C6944DEBFD3005AC90A9B70', '环境科学', 235000);

-- --------------------------------------------------------

--
-- 表的结构 `openid`
--

CREATE TABLE `openid` (
  `openid` varchar(128) NOT NULL COMMENT 'OPENID',
  `appId` varchar(64) NOT NULL COMMENT 'App ID',
  `id` int(11) NOT NULL COMMENT '学号',
  `createTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `openid_blacklist`
--

CREATE TABLE `openid_blacklist` (
  `openid` varchar(128) NOT NULL COMMENT 'openid',
  `remark` varchar(200) NOT NULL COMMENT '备注'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `org_id`
--

CREATE TABLE `org_id` (
  `orgId` mediumint(11) NOT NULL COMMENT '机构代码',
  `org` varchar(32) NOT NULL COMMENT '机构名称'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转存表中的数据 `org_id`
--

INSERT INTO `org_id` (`orgId`, `org`) VALUES
(135000, '思想政治教育研究中心'),
(159000, '教师教育研究院'),
(161000, '政法学院'),
(162000, '经济学院'),
(164000, '文学院'),
(166000, '历史文化学院'),
(167000, '外国语学院'),
(168000, '音乐学院'),
(169000, '美术学院'),
(170000, '数学与统计学院'),
(173000, '物理学院'),
(174000, '化学学院'),
(175000, '生命科学学院'),
(177000, '体育学院'),
(178000, '传媒科学学院（新闻学院）'),
(185000, '图书馆'),
(197000, '校医院'),
(201000, '附属中学'),
(232000, '教育学部'),
(234000, '地理科学学院'),
(235000, '环境学院'),
(236000, '马克思主义学部'),
(239000, '信息化管理与规划办公室'),
(245000, '东北师范大学罗格斯大学·纽瓦克学院'),
(246000, '国际汉学院（海外教育学院）'),
(247000, '中国赴日本国留学生预备学校(教育部出国留学人员培训部)'),
(252000, '信息科学与技术学院'),
(253000, '心理学院'),
(261000, '经济与管理学院'),
(264000, '后勤保障部'),
(265000, '前沿交叉研究院');

-- --------------------------------------------------------

--
-- 表的结构 `student_avatar`
--

CREATE TABLE `student_avatar` (
  `id` int(11) NOT NULL COMMENT '学号',
  `avatar` mediumtext NOT NULL COMMENT '用户头像'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `student_info`
--

CREATE TABLE `student_info` (
  `id` int(11) NOT NULL COMMENT '学号',
  `name` varchar(20) NOT NULL COMMENT '姓名',
  `org` varchar(32) NOT NULL COMMENT '组织',
  `orgId` int(11) NOT NULL COMMENT '组织 ID',
  `major` varchar(32) NOT NULL COMMENT '专业',
  `majorId` varchar(64) NOT NULL COMMENT '专业 ID',
  `inYear` smallint(6) NOT NULL COMMENT '入学年份',
  `grade` smallint(6) NOT NULL COMMENT '年级',
  `type` varchar(32) NOT NULL COMMENT '类型',
  `typeId` varchar(16) NOT NULL COMMENT '类型代码',
  `code` varchar(16) NOT NULL COMMENT '类别码',
  `politicalStatus` varchar(32) NOT NULL COMMENT '政治面貌',
  `people` varchar(16) NOT NULL COMMENT '民族',
  `peopleId` smallint(6) NOT NULL COMMENT '民族代码',
  `gender` varchar(2) NOT NULL COMMENT '性别',
  `genderId` tinyint(4) NOT NULL COMMENT '性别代码',
  `birth` char(10) NOT NULL COMMENT '出生日期',
  `location` varchar(8) NOT NULL COMMENT '位置',
  `createTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `updateTime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

-- --------------------------------------------------------

--
-- 表的结构 `token`
--

CREATE TABLE `token` (
  `authToken` varchar(128) NOT NULL COMMENT '登录 token',
  `id` int(11) NOT NULL COMMENT '学号',
  `appId` varchar(64) NOT NULL COMMENT 'App ID',
  `openid` varchar(128) DEFAULT NULL COMMENT 'Open ID',
  `updateTime` timestamp NOT NULL COMMENT '更新时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 转储表的索引
--

--
-- 表的索引 `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`openid`);

--
-- 表的索引 `condition_blacklist`
--
ALTER TABLE `condition_blacklist`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `contact`
--
ALTER TABLE `contact`
  ADD PRIMARY KEY (`uuid`);

--
-- 表的索引 `id_blacklist`
--
ALTER TABLE `id_blacklist`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `id_code`
--
ALTER TABLE `id_code`
  ADD PRIMARY KEY (`uuid`);

--
-- 表的索引 `log`
--
ALTER TABLE `log`
  ADD PRIMARY KEY (`uuid`);

--
-- 表的索引 `major_id`
--
ALTER TABLE `major_id`
  ADD PRIMARY KEY (`majorId`,`orgId`);

--
-- 表的索引 `openid_blacklist`
--
ALTER TABLE `openid_blacklist`
  ADD PRIMARY KEY (`openid`);

--
-- 表的索引 `org_id`
--
ALTER TABLE `org_id`
  ADD PRIMARY KEY (`orgId`);

--
-- 表的索引 `student_avatar`
--
ALTER TABLE `student_avatar`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `student_info`
--
ALTER TABLE `student_info`
  ADD PRIMARY KEY (`id`);

--
-- 表的索引 `token`
--
ALTER TABLE `token`
  ADD UNIQUE KEY `id` (`id`,`appId`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `condition_blacklist`
--
ALTER TABLE `condition_blacklist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
